SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26_prs.h
/* Bit fields for PRS CONSUMER_TIMER5_DTI */
#define _PRS_CONSUMER_TIMER5_DTI_RESETVALUE                  0x00000000UL                                   /**< Default value for PRS_CONSUMER_TIMER5_DTI   */
#define _PRS_CONSUMER_TIMER5_DTI_MASK                        0x0000000FUL                                   /**< Mask for PRS_CONSUMER_TIMER5_DTI            */
#define _PRS_CONSUMER_TIMER5_DTI_PRSSEL_SHIFT                0                                              /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER5_DTI_PRSSEL_MASK                 0xFUL                                          /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER5_DTI_PRSSEL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for PRS_CONSUMER_TIMER5_DTI    */
#define PRS_CONSUMER_TIMER5_DTI_PRSSEL_DEFAULT               (_PRS_CONSUMER_TIMER5_DTI_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER5_DTI*/

/* Bit fields for PRS CONSUMER_TIMER5_DTIFS1 */
#define _PRS_CONSUMER_TIMER5_DTIFS1_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_TIMER5_DTIFS1*/
#define _PRS_CONSUMER_TIMER5_DTIFS1_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_TIMER5_DTIFS1         */
#define _PRS_CONSUMER_TIMER5_DTIFS1_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER5_DTIFS1_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER5_DTIFS1_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_TIMER5_DTIFS1 */
#define PRS_CONSUMER_TIMER5_DTIFS1_PRSSEL_DEFAULT            (_PRS_CONSUMER_TIMER5_DTIFS1_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER5_DTIFS1*/

/* Bit fields for PRS CONSUMER_TIMER5_DTIFS2 */
#define _PRS_CONSUMER_TIMER5_DTIFS2_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_TIMER5_DTIFS2*/
#define _PRS_CONSUMER_TIMER5_DTIFS2_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_TIMER5_DTIFS2         */
#define _PRS_CONSUMER_TIMER5_DTIFS2_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER5_DTIFS2_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER5_DTIFS2_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_TIMER5_DTIFS2 */
#define PRS_CONSUMER_TIMER5_DTIFS2_PRSSEL_DEFAULT            (_PRS_CONSUMER_TIMER5_DTIFS2_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER5_DTIFS2*/

/* Bit fields for PRS CONSUMER_TIMER6_CC0 */
#define _PRS_CONSUMER_TIMER6_CC0_RESETVALUE                  0x00000000UL                                    /**< Default value for PRS_CONSUMER_TIMER6_CC0   */
#define _PRS_CONSUMER_TIMER6_CC0_MASK                        0x0000030FUL                                    /**< Mask for PRS_CONSUMER_TIMER6_CC0            */
#define _PRS_CONSUMER_TIMER6_CC0_PRSSEL_SHIFT                0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER6_CC0_PRSSEL_MASK                 0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER6_CC0_PRSSEL_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_TIMER6_CC0    */
#define PRS_CONSUMER_TIMER6_CC0_PRSSEL_DEFAULT               (_PRS_CONSUMER_TIMER6_CC0_PRSSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER6_CC0*/
#define _PRS_CONSUMER_TIMER6_CC0_SPRSSEL_SHIFT               8                                               /**< Shift value for PRS_SPRSSEL                 */
#define _PRS_CONSUMER_TIMER6_CC0_SPRSSEL_MASK                0x300UL                                         /**< Bit mask for PRS_SPRSSEL                    */
#define _PRS_CONSUMER_TIMER6_CC0_SPRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_TIMER6_CC0    */
#define PRS_CONSUMER_TIMER6_CC0_SPRSSEL_DEFAULT              (_PRS_CONSUMER_TIMER6_CC0_SPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER6_CC0*/

/* Bit fields for PRS CONSUMER_TIMER6_CC1 */
#define _PRS_CONSUMER_TIMER6_CC1_RESETVALUE                  0x00000000UL                                    /**< Default value for PRS_CONSUMER_TIMER6_CC1   */
#define _PRS_CONSUMER_TIMER6_CC1_MASK                        0x0000030FUL                                    /**< Mask for PRS_CONSUMER_TIMER6_CC1            */
#define _PRS_CONSUMER_TIMER6_CC1_PRSSEL_SHIFT                0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER6_CC1_PRSSEL_MASK                 0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER6_CC1_PRSSEL_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_TIMER6_CC1    */
#define PRS_CONSUMER_TIMER6_CC1_PRSSEL_DEFAULT               (_PRS_CONSUMER_TIMER6_CC1_PRSSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER6_CC1*/
#define _PRS_CONSUMER_TIMER6_CC1_SPRSSEL_SHIFT               8                                               /**< Shift value for PRS_SPRSSEL                 */
#define _PRS_CONSUMER_TIMER6_CC1_SPRSSEL_MASK                0x300UL                                         /**< Bit mask for PRS_SPRSSEL                    */
#define _PRS_CONSUMER_TIMER6_CC1_SPRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_TIMER6_CC1    */
#define PRS_CONSUMER_TIMER6_CC1_SPRSSEL_DEFAULT              (_PRS_CONSUMER_TIMER6_CC1_SPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER6_CC1*/

