SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26_prs.h
/* Bit fields for PRS CONSUMER_TIMER9_CC2 */
#define _PRS_CONSUMER_TIMER9_CC2_RESETVALUE                  0x00000000UL                                    /**< Default value for PRS_CONSUMER_TIMER9_CC2   */
#define _PRS_CONSUMER_TIMER9_CC2_MASK                        0x0000030FUL                                    /**< Mask for PRS_CONSUMER_TIMER9_CC2            */
#define _PRS_CONSUMER_TIMER9_CC2_PRSSEL_SHIFT                0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER9_CC2_PRSSEL_MASK                 0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER9_CC2_PRSSEL_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_TIMER9_CC2    */
#define PRS_CONSUMER_TIMER9_CC2_PRSSEL_DEFAULT               (_PRS_CONSUMER_TIMER9_CC2_PRSSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER9_CC2*/
#define _PRS_CONSUMER_TIMER9_CC2_SPRSSEL_SHIFT               8                                               /**< Shift value for PRS_SPRSSEL                 */
#define _PRS_CONSUMER_TIMER9_CC2_SPRSSEL_MASK                0x300UL                                         /**< Bit mask for PRS_SPRSSEL                    */
#define _PRS_CONSUMER_TIMER9_CC2_SPRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_TIMER9_CC2    */
#define PRS_CONSUMER_TIMER9_CC2_SPRSSEL_DEFAULT              (_PRS_CONSUMER_TIMER9_CC2_SPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER9_CC2*/

/* Bit fields for PRS CONSUMER_TIMER9_DTI */
#define _PRS_CONSUMER_TIMER9_DTI_RESETVALUE                  0x00000000UL                                   /**< Default value for PRS_CONSUMER_TIMER9_DTI   */
#define _PRS_CONSUMER_TIMER9_DTI_MASK                        0x0000000FUL                                   /**< Mask for PRS_CONSUMER_TIMER9_DTI            */
#define _PRS_CONSUMER_TIMER9_DTI_PRSSEL_SHIFT                0                                              /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER9_DTI_PRSSEL_MASK                 0xFUL                                          /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER9_DTI_PRSSEL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for PRS_CONSUMER_TIMER9_DTI    */
#define PRS_CONSUMER_TIMER9_DTI_PRSSEL_DEFAULT               (_PRS_CONSUMER_TIMER9_DTI_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER9_DTI*/

/* Bit fields for PRS CONSUMER_TIMER9_DTIFS1 */
#define _PRS_CONSUMER_TIMER9_DTIFS1_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_TIMER9_DTIFS1*/
#define _PRS_CONSUMER_TIMER9_DTIFS1_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_TIMER9_DTIFS1         */
#define _PRS_CONSUMER_TIMER9_DTIFS1_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER9_DTIFS1_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER9_DTIFS1_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_TIMER9_DTIFS1 */
#define PRS_CONSUMER_TIMER9_DTIFS1_PRSSEL_DEFAULT            (_PRS_CONSUMER_TIMER9_DTIFS1_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER9_DTIFS1*/

/* Bit fields for PRS CONSUMER_TIMER9_DTIFS2 */
#define _PRS_CONSUMER_TIMER9_DTIFS2_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_TIMER9_DTIFS2*/
#define _PRS_CONSUMER_TIMER9_DTIFS2_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_TIMER9_DTIFS2         */
#define _PRS_CONSUMER_TIMER9_DTIFS2_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_TIMER9_DTIFS2_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_TIMER9_DTIFS2_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_TIMER9_DTIFS2 */
#define PRS_CONSUMER_TIMER9_DTIFS2_PRSSEL_DEFAULT            (_PRS_CONSUMER_TIMER9_DTIFS2_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_TIMER9_DTIFS2*/

/* Bit fields for PRS CONSUMER_USART0_CLK */
#define _PRS_CONSUMER_USART0_CLK_RESETVALUE                  0x00000000UL                                   /**< Default value for PRS_CONSUMER_USART0_CLK   */
#define _PRS_CONSUMER_USART0_CLK_MASK                        0x0000000FUL                                   /**< Mask for PRS_CONSUMER_USART0_CLK            */
#define _PRS_CONSUMER_USART0_CLK_PRSSEL_SHIFT                0                                              /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART0_CLK_PRSSEL_MASK                 0xFUL                                          /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART0_CLK_PRSSEL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for PRS_CONSUMER_USART0_CLK    */
#define PRS_CONSUMER_USART0_CLK_PRSSEL_DEFAULT               (_PRS_CONSUMER_USART0_CLK_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART0_CLK*/

/* Bit fields for PRS CONSUMER_USART0_IR */
#define _PRS_CONSUMER_USART0_IR_RESETVALUE                   0x00000000UL                                  /**< Default value for PRS_CONSUMER_USART0_IR    */
#define _PRS_CONSUMER_USART0_IR_MASK                         0x0000000FUL                                  /**< Mask for PRS_CONSUMER_USART0_IR             */
#define _PRS_CONSUMER_USART0_IR_PRSSEL_SHIFT                 0                                             /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART0_IR_PRSSEL_MASK                  0xFUL                                         /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART0_IR_PRSSEL_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PRS_CONSUMER_USART0_IR     */
#define PRS_CONSUMER_USART0_IR_PRSSEL_DEFAULT                (_PRS_CONSUMER_USART0_IR_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART0_IR*/

/* Bit fields for PRS CONSUMER_USART0_RX */
#define _PRS_CONSUMER_USART0_RX_RESETVALUE                   0x00000000UL                                  /**< Default value for PRS_CONSUMER_USART0_RX    */
#define _PRS_CONSUMER_USART0_RX_MASK                         0x0000000FUL                                  /**< Mask for PRS_CONSUMER_USART0_RX             */
#define _PRS_CONSUMER_USART0_RX_PRSSEL_SHIFT                 0                                             /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART0_RX_PRSSEL_MASK                  0xFUL                                         /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART0_RX_PRSSEL_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PRS_CONSUMER_USART0_RX     */
#define PRS_CONSUMER_USART0_RX_PRSSEL_DEFAULT                (_PRS_CONSUMER_USART0_RX_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART0_RX*/

/* Bit fields for PRS CONSUMER_USART0_TRIGGER */
#define _PRS_CONSUMER_USART0_TRIGGER_RESETVALUE              0x00000000UL                                       /**< Default value for PRS_CONSUMER_USART0_TRIGGER*/
#define _PRS_CONSUMER_USART0_TRIGGER_MASK                    0x0000000FUL                                       /**< Mask for PRS_CONSUMER_USART0_TRIGGER        */
#define _PRS_CONSUMER_USART0_TRIGGER_PRSSEL_SHIFT            0                                                  /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART0_TRIGGER_PRSSEL_MASK             0xFUL                                              /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART0_TRIGGER_PRSSEL_DEFAULT          0x00000000UL                                       /**< Mode DEFAULT for PRS_CONSUMER_USART0_TRIGGER*/
#define PRS_CONSUMER_USART0_TRIGGER_PRSSEL_DEFAULT           (_PRS_CONSUMER_USART0_TRIGGER_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART0_TRIGGER*/

/* Bit fields for PRS CONSUMER_USART1_CLK */
#define _PRS_CONSUMER_USART1_CLK_RESETVALUE                  0x00000000UL                                   /**< Default value for PRS_CONSUMER_USART1_CLK   */
#define _PRS_CONSUMER_USART1_CLK_MASK                        0x0000000FUL                                   /**< Mask for PRS_CONSUMER_USART1_CLK            */
#define _PRS_CONSUMER_USART1_CLK_PRSSEL_SHIFT                0                                              /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART1_CLK_PRSSEL_MASK                 0xFUL                                          /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART1_CLK_PRSSEL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for PRS_CONSUMER_USART1_CLK    */
#define PRS_CONSUMER_USART1_CLK_PRSSEL_DEFAULT               (_PRS_CONSUMER_USART1_CLK_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART1_CLK*/

/* Bit fields for PRS CONSUMER_USART1_IR */
#define _PRS_CONSUMER_USART1_IR_RESETVALUE                   0x00000000UL                                  /**< Default value for PRS_CONSUMER_USART1_IR    */
#define _PRS_CONSUMER_USART1_IR_MASK                         0x0000000FUL                                  /**< Mask for PRS_CONSUMER_USART1_IR             */
#define _PRS_CONSUMER_USART1_IR_PRSSEL_SHIFT                 0                                             /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART1_IR_PRSSEL_MASK                  0xFUL                                         /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART1_IR_PRSSEL_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PRS_CONSUMER_USART1_IR     */
#define PRS_CONSUMER_USART1_IR_PRSSEL_DEFAULT                (_PRS_CONSUMER_USART1_IR_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART1_IR*/

/* Bit fields for PRS CONSUMER_USART1_RX */
#define _PRS_CONSUMER_USART1_RX_RESETVALUE                   0x00000000UL                                  /**< Default value for PRS_CONSUMER_USART1_RX    */
#define _PRS_CONSUMER_USART1_RX_MASK                         0x0000000FUL                                  /**< Mask for PRS_CONSUMER_USART1_RX             */
#define _PRS_CONSUMER_USART1_RX_PRSSEL_SHIFT                 0                                             /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART1_RX_PRSSEL_MASK                  0xFUL                                         /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART1_RX_PRSSEL_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PRS_CONSUMER_USART1_RX     */
#define PRS_CONSUMER_USART1_RX_PRSSEL_DEFAULT                (_PRS_CONSUMER_USART1_RX_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART1_RX*/

/* Bit fields for PRS CONSUMER_USART1_TRIGGER */
#define _PRS_CONSUMER_USART1_TRIGGER_RESETVALUE              0x00000000UL                                       /**< Default value for PRS_CONSUMER_USART1_TRIGGER*/
#define _PRS_CONSUMER_USART1_TRIGGER_MASK                    0x0000000FUL                                       /**< Mask for PRS_CONSUMER_USART1_TRIGGER        */
#define _PRS_CONSUMER_USART1_TRIGGER_PRSSEL_SHIFT            0                                                  /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART1_TRIGGER_PRSSEL_MASK             0xFUL                                              /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART1_TRIGGER_PRSSEL_DEFAULT          0x00000000UL                                       /**< Mode DEFAULT for PRS_CONSUMER_USART1_TRIGGER*/
#define PRS_CONSUMER_USART1_TRIGGER_PRSSEL_DEFAULT           (_PRS_CONSUMER_USART1_TRIGGER_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART1_TRIGGER*/

/* Bit fields for PRS CONSUMER_USART2_CLK */
#define _PRS_CONSUMER_USART2_CLK_RESETVALUE                  0x00000000UL                                   /**< Default value for PRS_CONSUMER_USART2_CLK   */
#define _PRS_CONSUMER_USART2_CLK_MASK                        0x0000000FUL                                   /**< Mask for PRS_CONSUMER_USART2_CLK            */
#define _PRS_CONSUMER_USART2_CLK_PRSSEL_SHIFT                0                                              /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART2_CLK_PRSSEL_MASK                 0xFUL                                          /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART2_CLK_PRSSEL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for PRS_CONSUMER_USART2_CLK    */
#define PRS_CONSUMER_USART2_CLK_PRSSEL_DEFAULT               (_PRS_CONSUMER_USART2_CLK_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART2_CLK*/

/* Bit fields for PRS CONSUMER_USART2_IR */
#define _PRS_CONSUMER_USART2_IR_RESETVALUE                   0x00000000UL                                  /**< Default value for PRS_CONSUMER_USART2_IR    */
#define _PRS_CONSUMER_USART2_IR_MASK                         0x0000000FUL                                  /**< Mask for PRS_CONSUMER_USART2_IR             */
#define _PRS_CONSUMER_USART2_IR_PRSSEL_SHIFT                 0                                             /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_USART2_IR_PRSSEL_MASK                  0xFUL                                         /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_USART2_IR_PRSSEL_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PRS_CONSUMER_USART2_IR     */
#define PRS_CONSUMER_USART2_IR_PRSSEL_DEFAULT                (_PRS_CONSUMER_USART2_IR_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_USART2_IR*/

